tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
brew "ack"
brew "automake"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "brew-php-switcher"
brew "gettext"
brew "coreutils"
brew "cask"
brew "readline"
brew "php"
brew "composer"
brew "dos2unix"
brew "ffmpeg"
brew "findutils"
brew "git"
brew "git-extras"
brew "git-flow"
brew "imagemagick"
brew "intltool"
brew "jpeg"
brew "zlib"
brew "mysql", restart_service: true
brew "nvm"
brew "perl"
brew "pkg-config"
brew "pyenv"
brew "python@3"
brew "rename"
brew "ruby"
brew "terminal-notifier"
brew "tree"
brew "wp-cli"
cask "bitbar", args: { appdir: "/Applications" }
cask "dash", args: { appdir: "/Applications" }
cask "docker"
cask "flux", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "wkhtmltopdf"
cask "xquartz"
vscode "akamud.vscode-caniuse"
vscode "alefragnani.Bookmarks"
vscode "alefragnani.project-manager"
vscode "alexdima.copy-relative-path"
vscode "andyyaldoo.vscode-json"
vscode "anthonydiametrix.ACF-Snippet"
vscode "bmewburn.vscode-intelephense-client"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "dariofuzinato.vue-peek"
vscode "dbaeumer.vscode-eslint"
vscode "DEVSENSE.composer-php-vscode"
vscode "DEVSENSE.phptools-vscode"
vscode "DEVSENSE.profiler-php-vscode"
vscode "DSKWRK.vscode-generate-getter-setter"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-execution"
vscode "GraphQL.vscode-graphql-syntax"
vscode "IBM.output-colorizer"
vscode "johnbillion.vscode-wordpress-hooks"
vscode "johnpapa.Angular2"
vscode "johnpapa.vscode-peacock"
vscode "mgesbert.python-path"
vscode "midnightsyntax.vscode-wrap-console-log"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "mrmlnc.vscode-apache"
vscode "mrmlnc.vscode-duplicate"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.sublime-keybindings"
vscode "obliviousharmony.vscode-php-codesniffer"
vscode "octref.vetur"
vscode "sdras.vue-vscode-snippets"
vscode "svipas.prettier-plus"
vscode "Tyriar.sort-lines"
vscode "valeryanm.vscode-phpsab"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "wmaurer.change-case"
vscode "wmaurer.vscode-jumpy"
vscode "wordpresstoolbox.wordpress-toolbox"
vscode "xabikos.JavaScriptSnippets"
vscode "xdebug.php-debug"
vscode "yogensia.searchwpdocs"
vscode "yzhang.markdown-all-in-one"
vscode "zobo.php-intellisense"
